export default {
  namespaced: true,
  state() {
    return {
      cards: [
        {
          id: 1,
          title: 'Устранение «жировых ловушек» и локальных отложений жира',
        },
        {
          id: 2,
          title: 'Устранение целлюлита',
        },
        {
          id: 3,
          title: 'Уменьшение объемов проблемных зон',
        },
        {
          id: 4,
          title: 'Лифтинг и улучшение качества кожи',
        },
        {
          id: 5,
          title: 'Устранение отеков',
        },
        {
          id: 6,
          title: 'Улучшение микроциркуляции крови, лимфотока',
        },
        {
          id: 7,
          title: 'Лимфодренаж, вывод токсинов',
        },
        {
          id: 8,
          title:
            'Сокращение восстановительного периода после травм и тренировок',
        },
      ],
    }
  },
  mutations: {},
  actions: {},
  getters: {},
}
